// ভিডিও ১: লুপিং টেকনিক (Looping Techniques)
// looping technique
//  for loop
// while loop
// do while loop
// for of ---> array loop করার জন্য
// for in loop ---> objects এ loop করার জন্য

const friends = [ 'Elon' , 'Bill', 'Mark', 'Waren' ] ;
for ( const friend of friends){
    // console.log(friend)
}

// for loop দিয়ে এলিমেন্ট এক্সেস (উদাহরণ - ১)
for (let i = 0; i < friends.length; i ++){
    console.log(i)
    console.log(friends[i])
}

// for loop দিয়ে এলিমেন্ট এক্সেস (উদাহরণ - ২)
const numberss = [5, 5465, 444, 44, 55, 44 ,442]
for(let i = 0; i< numberss.length; i ++){
    console.log(numberss[i])
}

// while loop দিয়ে এলিমেন্ট এক্সেস
let i = 0
while (i < friends.length){
    console.log(friends[i])
    i++;
}


//  ভিডিও ২: অ্যারে রিভার্স (Reverse Array)
const numbers = [1, 2, 3, 4, 5, 6, 7]

// উদাহরণ - ১: সরাসরি .reverse() মেথড ব্যবহার করে
// numbers.reverse()
/**
 📝 নোট: এই মেথডটি সরাসরি মেইন অ্যারের এলিমেন্টগুলোকে উল্টো করে সাজিয়ে দেয়।
 */

// উদাহরণ - ২: for of loop এবং unshift ব্যবহার করে
const rev_numbers = []
for (const num of numbers){
    rev_numbers.unshift(num) 
}
/**
 📝 নোট: .unshift() মেথডটি যেকোনো নতুন এলিমেন্টকে অ্যারের একদম শুরুতে (সবার আগে) যোগ করে। 
 লুপ যখন ১ পায় সে শুরুতে রাখে, এরপর ২ কে ১ এর সামনে বসায়, এভাবেই সব উল্টে যায়।
 */

// উদাহরণ - ৩: সাধারণ for loop ব্যবহার করে
const reversed_numbers = []
for (let i = 0; i <numbers.length; i++){
    const num = numbers[i];
    reversed_numbers.unshift(num)
}
/**
 📝 নোট: এখানে লুপ শুরু থেকে শেষ পর্যন্ত চলছে এবং unshift এর মাধ্যমে প্রতিটি এলিমেন্টকে 
 নতুন অ্যারের সামনে ঠেলে দেওয়া হচ্ছে, ফলে এটি রিভার্স হয়ে যাচ্ছে।
 */

// উদাহরণ - ৪: লুপ শেষ দিক থেকে চালিয়ে (Decrementing loop)
const rev_rev_numbers = []
for (let i = numbers.length - 1; i>= 0 ; i--){
    const num = numbers[i]
    rev_rev_numbers.push(num)
}
/**
 📝 নোট: এখানে লুপটি অ্যারের শেষ ইনডেক্স থেকে শুরু হয়ে ০ পর্যন্ত উল্টো দিকে চলছে। 
 যেহেতু আমরা শেষ থেকেই শুরু করছি, তাই .push() করলেই এলিমেন্টগুলো উল্টোভাবে জমা হচ্ছে।
 */


//  ভিডিও ৩: সর্টিং (Sorting)
const person = ['rakib' , 'akib' , 'sakib', 'dakib', 'nakib']
const sortedPersons = person.sort()
console.log(sortedPersons)

/**
 📝 নোট: স্ট্রিংয়ের ক্ষেত্রে .sort() মেথডটি ডিকশনারি বা অ্যালফাবেটিকাল অর্ডারে সাজায়।
 */

const num_list = [4, 7, 2, 8, 3, 6]
const numbers_asc_simple = num_list.sort()
/**
 📝 নোট: যদি সংখ্যাগুলো ১ ডিজিটের হয়, তবে সরাসরি .sort() মেথডটি ছোট থেকে বড় সাজিয়ে দেয়।
 */

// বড় সংখ্যা সর্টিং করার সঠিক নিয়ম (Compare Function)

const numbers_big = [4, 7, 12, 8, 43, 6, 1]
const numbers_asc = [...numbers_big].sort(function(a, b) { return a - b });
const numbers_dsc = [...numbers_big].sort(function(a, b) { return b - a });

/**
 📝 নোট: জাভাস্ক্রিপ্ট ডিফল্টভাবে সংখ্যাকে স্ট্রিং মনে করে সর্ট করে, তাই ভুল রেজাল্ট আসে। 
 এটি ঠিক করতে (a - b) ব্যবহার করা হয়। (a - b) এর বিয়োগফল পজিটিভ হলে বড় সংখ্যা পেছনে যায় (Ascending)।
 */

/**
 📝 নোট: এখানে b - a করার মানে হলো- বিয়োগফল পজিটিভ হলে বড় সংখ্যাটি বামে (সামনে) চলে আসবে। 
 এভাবে বড় থেকে ছোট সিরিয়াল (Descending) তৈরি হবে।
 */

 